[CorpseMutonElite X2ItemTemplate]
FriendlyName="Muton Elite Corpse"
FriendlyNamePlural="Muton Elite Corpses"
BriefSummary="Hidden beneath their battle armor, intricate tattoos and ritualized scarring make clear the Muton's continuing dedication to their tribal hierarchy." 

[MutonElite X2CharacterTemplate]
strCharacterName="Muton Elite"
strAcquiredText="Muton Elite carry a personal shield generator." 


[MutonElite_PersonalShield X2AbilityTemplate]
LocFriendlyName="Personal Shield"
LocFlyOverText="Personal Shieldgenerator"
LocHelpText="Grants 4 points of ablative armor."
LocLongDescription="Grants 4 points of ablative armor."
LocPromotionPopupText="<Bullet/> Grants 4 points of ablative armor.<br/><Bullet/> Uses one action; does not end turn.<br/>"

[PersonalShield_Xcom X2AbilityTemplate]
LocFriendlyName="Personal Shield"
LocFlyOverText="Personal Shield Generator"
LocHelpText="Grants 3 points of ablative armor."
LocLongDescription="Grants 3 points of ablative armor."
LocPromotionPopupText="<Bullet/> Grants 3 points of ablative armor.<br/><Bullet/> It is a free action.<br/><Bullet/> Only last 1 turn.<br/><Bullet/> Start with 2 charges.<br/>"


[MutonElite_WPN X2WeaponTemplate]
FriendlyName="Muton Elite Cannon"
FriendlyNamePlural="Muton Elite Cannons"
BriefSummary="Muton Elite came up with a cannon of their own."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn.\n<Bullet/>"

[MutonEliteGrenade X2CharacterTemplate]
FriendlyName="Muton Elite Grenade"
FriendlyNamePlural="Muton Elite Grenades"
BriefSummary="Muton Elite came up with a hand grenade of their own."
TacticalText="<Bullet/> Throwing a grenade does not ends the soldier's turn.\n<Bullet/>"


[MutonElite_MeleeAttack X2WeaponTemplate]
FriendlyName="Muton Elite Bayonet"
FriendlyNamePlural="Muton Elite Bayonets"
BriefSummary="Muton Elite came up with a bayonet of their own."
TacticalText="<Bullet/> Using thebayonet always ends the soldier's turn.\n<Bullet/>"

[PersonalShield_Xcom X2EquipmentTemplate]
FriendlyName="Personal shield Vest"
FriendlyNamePlural="Personal shield Vest"
BriefSummary="By reinforcing the Nanoscale Vest with the muton elite materials, soldiers gain an additional health boost and the ability to gain a bonus of ablative armor for one turn."
TacticalText="<Bullet/> A vest that grant the ability Personal shield.<br/>"

[AutopsyMutonElite X2TechTemplate]
DisplayName="Muton Elite Autopsy"
Summary="This behemoth is different enough from other Mutons that it merits a specific investigation."
CodeName="Bluton"
LongDescription="Central Officer Bradford has indicated that X-COM had intelligence reports of an elite form of muton that served as a guardian to the Elders. This creature appears to be that form. The genetic enhancements extend into the creature's brain, suggesting it is more able to recognize complex patterns and process information quickly in combat situations. R. Tygan."
AlertString="Muton"